// var a = [1, 2, 3];
// var b = [4, 5, 6];
// var c = a.concat(b);
// console.log(a);
// console.log(b);
// console.log(c);

/////////////////////////////////////////////////////////////////////////////

// var a = [1, 2, 3];
// a = a.reverse();
// console.log(a);

/////////////////////////////////////////////////////////////////////////////

// var a = [1, 2, 3];
// var b = [1, 2, 3];
// a.push(4, 5, 6);
// b.unshift(4, 5, 6);
// console.log(a);
// console.log(b);

/////////////////////////////////////////////////////////////////////////////

// var a = [1, 2, 3, 4, 5];
// var b = a.slice(0, 3);
// var c = a.slice(3, 5);
// console.log(b);
// console.log(c);

/////////////////////////////////////////////////////////////////////////////

// var a = [1, 2, 3, 4, 5];
// a.splice(1, 2);
// console.log(a);

// var a = [1, 2, 3, 4, 5];
// var b = a.splice(1, 3);
// console.log(b);

// var a = [1, 2, 3, 4, 5];
// a.splice(3, 0, 'a', 'b', 'c');
// console.log(a);

// var a = [1, 2, 3, 4, 5];
// a.splice(1, 4, 'a', 'b', 2, 3, 4, 'c', 5, 'e');
// console.log(a);

/////////////////////////////////////////////////////////////////////////////

// var a = [3, 4, 1, 2, 7];
// a.sort();
// console.log(a);

/////////////////////////////////////////////////////////////////////////////

// var a = '123456';
// a = a.split('').reverse().join('');
// console.log(a);

/////////////////////////////////////////////////////////////////////////////

// var a = prompt('Проверка на http://')
// a = a.split('');
// var b = a.splice(0, 7).join('');
// if (b == 'http://') alert('Строка начинаеться на http://');
// else alert('Строка не начинаеться на http://');

/////////////////////////////////////////////////////////////////////////////

// var a = prompt('Проверка на .html')
// a = a.split('');
// var b = a.splice(-5, 5).join('');
// if (b == '.html') alert('Строка заканчиваеться на .html');
// else alert('Строка не заканчиваеться на .html');
// console.log(b);
